In [19]:
In [1]: import numpy as np

In [2]: import pandas as pd

In [20]:
In [3]: from pandas import Series, DataFrame

In [21]:
In [14]: obj = pd.Series([4, 7, -5, 3])

In [22]:
In [15]: obj

0    4
1    7
2   -5
3    3
dtype: int64

In [23]:
In [16]: obj.array

<NumpyExtensionArray>
[np.int64(4), np.int64(7), np.int64(-5), np.int64(3)]
Length: 4, dtype: int64

In [24]:
In [17]: obj.index

RangeIndex(start=0, stop=4, step=1)

In [25]:
In [18]: obj2 = pd.Series([4, 7, -5, 3], index=["d", "b", "a", "c"])

In [26]:
In [19]: obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [35]:
In [16]: obj.array

<NumpyExtensionArray>
[np.int64(4), np.int64(7), np.int64(-5), np.int64(3)]
Length: 4, dtype: int64

In [36]:
In [17]: obj.index

RangeIndex(start=0, stop=4, step=1)

In [37]:
In [18]: obj2 = pd.Series([4, 7, -5, 3], index=["d", "b", "a", "c"])

In [38]:
In [19]: obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [39]:
In [20]: obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [40]:
In [21]: obj2["a"]

np.int64(-5)

In [41]:
In [24]: obj2[obj2 > 0]

d    4
b    7
c    3
dtype: int64

In [42]:
In [25]: obj2 * 2

d     8
b    14
a   -10
c     6
dtype: int64

In [43]:
In [26]: import numpy as np

In [44]:
In [27]: np.exp(obj2)

d      54.598150
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [45]:
In [28]: "b" in obj2

True

In [46]:
In [29]: "e" in obj2

False

In [47]:
In [30]: sdata = {"Ohio": 35000, "Texas": 71000, "Oregon": 16000, "Utah": 5000}

In [48]:
In [31]: obj3 = pd.Series(sdata)

In [49]:
In [32]: obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [50]:
In [33]: obj3.to_dict()

{'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

In [51]:
In [34]: states = ["California", "Ohio", "Oregon", "Texas"]

In [52]:
In [35]: obj4 = pd.Series(sdata, index=states)

In [53]:
In [36]: obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [54]:
In [37]: pd.isna(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [55]:
In [38]: pd.notna(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [56]:
In [39]: obj4.isna()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [57]:
In [40]: obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [58]:
In [41]: obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [59]:
In [42]: obj3 + obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [60]:
In [43]: obj4.name = "population"

In [61]:
In [44]: obj4.index.name = "state"

In [62]:
In [45]: obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [63]:
In [46]: obj

0    4
1    7
2   -5
3    3
dtype: int64

In [64]:
In [47]: obj.index = ["Bob", "Steve", "Jeff", "Ryan"]

In [65]:
In [48]: obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

In [66]:
data = {"state": ["Ohio", "Ohio", "Ohio", "Nevada", "Nevada", "Nevada"],
        "year": [2000, 2001, 2002, 2001, 2002, 2003],
        "pop": [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame = pd.DataFrame(data)

In [67]:
In [50]: frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [68]:
In [51]: frame.head()

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [69]:
In [52]: frame.tail()

    state  year  pop
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [70]:
In [53]: pd.DataFrame(data, columns=["year", "state", "pop"])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [71]:
In [54]: frame2 = pd.DataFrame(data, columns=["year", "state", "pop", "debt"])

In [72]:
In [55]: frame2

   year   state  pop debt
0  2000    Ohio  1.5  NaN
1  2001    Ohio  1.7  NaN
2  2002    Ohio  3.6  NaN
3  2001  Nevada  2.4  NaN
4  2002  Nevada  2.9  NaN
5  2003  Nevada  3.2  NaN

In [73]:
In [56]: frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [74]:
In [57]: frame2["state"]

0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
5    Nevada
Name: state, dtype: object

In [75]:
In [58]: frame2.year

0    2000
1    2001
2    2002
3    2001
4    2002
5    2003
Name: year, dtype: int64

In [76]:
In [59]: frame2.loc[1]

year     2001
state    Ohio
pop       1.7
debt      NaN
Name: 1, dtype: object

In [77]:
In [60]: frame2.iloc[2]

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: 2, dtype: object

In [78]:
In [61]: frame2["debt"] = 16.5

In [79]:
In [62]: frame2

   year   state  pop  debt
0  2000    Ohio  1.5  16.5
1  2001    Ohio  1.7  16.5
2  2002    Ohio  3.6  16.5
3  2001  Nevada  2.4  16.5
4  2002  Nevada  2.9  16.5
5  2003  Nevada  3.2  16.5

In [80]:
In [63]: frame2["debt"] = np.arange(6.)

In [81]:
In [64]: frame2

   year   state  pop  debt
0  2000    Ohio  1.5   0.0
1  2001    Ohio  1.7   1.0
2  2002    Ohio  3.6   2.0
3  2001  Nevada  2.4   3.0
4  2002  Nevada  2.9   4.0
5  2003  Nevada  3.2   5.0

In [82]:
In [65]: val = pd.Series([-1.2, -1.5, -1.7], index=[2, 4, 5])

In [83]:
In [66]: frame2["debt"] = val

In [84]:
In [67]: frame2

   year   state  pop  debt
0  2000    Ohio  1.5   NaN
1  2001    Ohio  1.7   NaN
2  2002    Ohio  3.6  -1.2
3  2001  Nevada  2.4   NaN
4  2002  Nevada  2.9  -1.5
5  2003  Nevada  3.2  -1.7

In [85]:
In [68]: frame2["eastern"] = frame2["state"] == "Ohio"

In [86]:
In [69]: frame2

   year   state  pop  debt  eastern
0  2000    Ohio  1.5   NaN     True
1  2001    Ohio  1.7   NaN     True
2  2002    Ohio  3.6  -1.2     True
3  2001  Nevada  2.4   NaN    False
4  2002  Nevada  2.9  -1.5    False
5  2003  Nevada  3.2  -1.7    False

In [87]:
In [70]: del frame2["eastern"]

In [88]:
In [71]: frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [89]:
In [72]: populations = {"Ohio": {2000: 1.5, 2001: 1.7, 2002: 3.6},
   ....:                "Nevada": {2001: 2.4, 2002: 2.9}}

In [90]:
In [73]: frame3 = pd.DataFrame(populations)

In [91]:
In [74]: frame3

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4
2002   3.6     2.9

In [92]:
In [75]: frame3.T

        2000  2001  2002
Ohio     1.5   1.7   3.6
Nevada   NaN   2.4   2.9

In [93]:
In [76]: pd.DataFrame(populations, index=[2001, 2002, 2003])

      Ohio  Nevada
2001   1.7     2.4
2002   3.6     2.9
2003   NaN     NaN

In [94]:
In [77]: pdata = {"Ohio": frame3["Ohio"][:-1],
   ....:          "Nevada": frame3["Nevada"][:2]}

In [95]:
In [78]: pd.DataFrame(pdata)

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4

In [96]:
In [79]: frame3.index.name = "year"

In [97]:
In [80]: frame3.columns.name = "state"

In [98]:
In [81]: frame3

state  Ohio  Nevada
year
2000    1.5     NaN
2001    1.7     2.4
2002    3.6     2.9

In [99]:
In [82]: frame3.to_numpy()

array([[1.5, nan],
       [1.7, 2.4],
       [3.6, 2.9]])

In [100]:
In [83]: frame2.to_numpy()

array([[2000, 'Ohio', 1.5, nan],
       [2001, 'Ohio', 1.7, nan],
       [2002, 'Ohio', 3.6, -1.2],
       [2001, 'Nevada', 2.4, nan],
       [2002, 'Nevada', 2.9, -1.5],
       [2003, 'Nevada', 3.2, -1.7]], dtype=object)

In [101]:
In [84]: obj = pd.Series(np.arange(3), index=["a", "b", "c"])

In [102]:
In [85]: index = obj.index

In [103]:
In [86]: index

Index(['a', 'b', 'c'], dtype='object')

In [104]:
In [87]: index[1:]

Index(['b', 'c'], dtype='object')

In [107]:
index[1] = "d"  # TypeError

TypeError: Index does not support mutable operations

In [108]:
In [88]: labels = pd.Index(np.arange(3))

In [109]:
In [89]: labels

Index([0, 1, 2], dtype='int64')

In [110]:
In [90]: obj2 = pd.Series([1.5, -2.5, 0], index=labels)

In [111]:
In [91]: obj2

0    1.5
1   -2.5
2    0.0
dtype: float64

In [112]:
In [92]: obj2.index is labels

True

In [113]:
In [93]: frame3

state  Ohio  Nevada
year
2000    1.5     NaN
2001    1.7     2.4
2002    3.6     2.9

In [114]:
In [94]: frame3.columns

Index(['Ohio', 'Nevada'], dtype='object', name='state')

In [115]:
In [95]: "Ohio" in frame3.columns

True

In [116]:
In [96]: 2003 in frame3.index

False

In [117]:
In [97]: pd.Index(["foo", "foo", "bar", "bar"])

Index(['foo', 'foo', 'bar', 'bar'], dtype='object')

In [118]:
In [98]: obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=["d", "b", "a", "c"])

In [119]:
In [99]: obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [120]:
In [100]: obj2 = obj.reindex(["a", "b", "c", "d", "e"])

In [121]:
In [101]: obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [122]:
In [102]: obj3 = pd.Series(["blue", "purple", "yellow"], index=[0, 2, 4])

In [123]:
In [103]: obj3

0      blue
2    purple
4    yellow
dtype: object

In [124]:
In [104]: obj3.reindex(np.arange(6), method="ffill")

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [125]:
In [105]: frame = pd.DataFrame(np.arange(9).reshape((3, 3)),
   .....:                      index=["a", "c", "d"],
   .....:                      columns=["Ohio", "Texas", "California"])

In [126]:
In [106]: frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [127]:
In [107]: frame2 = frame.reindex(index=["a", "b", "c", "d"])

In [128]:
In [108]: frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [129]:
In [109]: states = ["Texas", "Utah", "California"]

In [130]:
In [110]: frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [131]:
In [111]: frame.reindex(states, axis="columns")

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [132]:
In [112]: frame.loc[["a", "d", "c"], ["California", "Texas"]]

   California  Texas
a           2      1
d           8      7
c           5      4

In [133]:
In [113]: obj = pd.Series(np.arange(5.), index=["a", "b", "c", "d", "e"])

In [134]:
In [114]: obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [135]:
In [115]: new_obj = obj.drop("c")

In [136]:
In [116]: new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [137]:
In [117]: obj.drop(["d", "c"])

a    0.0
b    1.0
e    4.0
dtype: float64

In [138]:
In [118]: data = pd.DataFrame(np.arange(16).reshape((4, 4)),
   .....:                     index=["Ohio", "Colorado", "Utah", "New York"],
   .....:                     columns=["one", "two", "three", "four"])

In [139]:
In [119]: data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [140]:
In [120]: data.drop(index=["Colorado", "Ohio"])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [141]:
In [121]: data.drop(columns=["two"])

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [142]:
In [122]: data.drop("two", axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [143]:
In [123]: data.drop(["two", "four"], axis="columns")

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

In [144]:
In [124]: obj = pd.Series(np.arange(4.), index=["a", "b", "c", "d"])

In [145]:
In [125]: obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [148]:
In [126]: obj["b"]

np.float64(1.0)

In [149]:
In [127]: obj[1]

/var/folders/nf/zm9hb0654b163bnmw_ts6bwh0000gp/T/ipykernel_86611/1493022122.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  obj[1]

np.float64(1.0)

In [150]:
In [128]: obj[2:4]

c    2.0
d    3.0
dtype: float64

In [151]:
In [129]: obj[["b", "a", "d"]]

b    1.0
a    0.0
d    3.0
dtype: float64

In [152]:
In [130]: obj[[1, 3]]

/var/folders/nf/zm9hb0654b163bnmw_ts6bwh0000gp/T/ipykernel_86611/2931917867.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  obj[[1, 3]]

b    1.0
d    3.0
dtype: float64

In [153]:
In [131]: obj[obj < 2]

a    0.0
b    1.0
dtype: float64

In [154]:
In [132]: obj.loc[["b", "a", "d"]]

b    1.0
a    0.0
d    3.0
dtype: float64

In [155]:
In [133]: obj1 = pd.Series([1, 2, 3], index=[2, 0, 1])

In [156]:
In [134]: obj2 = pd.Series([1, 2, 3], index=["a", "b", "c"])

In [157]:
In [135]: obj1

2    1
0    2
1    3
dtype: int64

In [158]:
In [136]: obj2

a    1
b    2
c    3
dtype: int64

In [159]:
In [137]: obj1[[0, 1, 2]]

0    2
1    3
2    1
dtype: int64

In [160]:
In [138]: obj2[[0, 1, 2]]

/var/folders/nf/zm9hb0654b163bnmw_ts6bwh0000gp/T/ipykernel_86611/2955242597.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  obj2[[0, 1, 2]]

a    1
b    2
c    3
dtype: int64

In [161]:
In [134]: obj2.loc[[0, 1]]

KeyError: "None of [Index([0, 1], dtype='int64')] are in the [index]"

In [162]:
In [139]: obj1.iloc[[0, 1, 2]]

2    1
0    2
1    3
dtype: int64

In [163]:
In [140]: obj2.iloc[[0, 1, 2]]

a    1
b    2
c    3
dtype: int64

In [164]:
In [141]: obj2.loc["b":"c"]

b    2
c    3
dtype: int64

In [165]:
In [142]: obj2.loc["b":"c"] = 5

In [166]:
In [143]: obj2

a    1
b    5
c    5
dtype: int64

In [167]:
In [144]: data = pd.DataFrame(np.arange(16).reshape((4, 4)),
   .....:                     index=["Ohio", "Colorado", "Utah", "New York"],
   .....:                     columns=["one", "two", "three", "four"])

In [168]:
In [145]: data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [169]:
In [146]: data["two"]

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int64

In [170]:
In [147]: data[["three", "one"]]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [171]:
In [148]: data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [172]:
In [149]: data[data["three"] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [173]:
In [150]: data < 5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [174]:
In [151]: data[data < 5] = 0

In [175]:
In [152]: data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [176]:
In [153]: data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [177]:
In [154]: data.loc["Colorado"]

one      0
two      5
three    6
four     7
Name: Colorado, dtype: int64

In [178]:
In [155]: data.loc[["Colorado", "New York"]]

          one  two  three  four
Colorado    0    5      6     7
New York   12   13     14    15

In [179]:
In [156]: data.loc["Colorado", ["two", "three"]]

two      5
three    6
Name: Colorado, dtype: int64

In [180]:
In [157]: data.iloc[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int64

In [181]:
In [158]: data.iloc[[2, 1]]

          one  two  three  four
Utah        8    9     10    11
Colorado    0    5      6     7

In [182]:
In [159]: data.iloc[2, [3, 0, 1]]

four    11
one      8
two      9
Name: Utah, dtype: int64

In [183]:
In [160]: data.iloc[[1, 2], [3, 0, 1]]

          four  one  two
Colorado     7    0    5
Utah        11    8    9

In [184]:
In [161]: data.loc[:"Utah", "two"]

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int64

In [185]:
In [162]: data.iloc[:, :3][data.three > 5]

          one  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

In [186]:
In [163]: data.loc[data.three >= 2]

          one  two  three  four
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [187]:
In [164]: ser = pd.Series(np.arange(3.))

In [188]:
In [165]: ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [189]:
In [166]: ser[-1]

KeyError: -1

In [190]:
In [167]: ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [191]:
In [168]: ser2 = pd.Series(np.arange(3.), index=["a", "b", "c"])

In [192]:
In [169]: ser2[-1]

/var/folders/nf/zm9hb0654b163bnmw_ts6bwh0000gp/T/ipykernel_86611/3685035418.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  ser2[-1]

np.float64(2.0)

In [193]:
In [170]: ser.iloc[-1]

np.float64(2.0)

In [194]:
In [171]: ser[:2]

0    0.0
1    1.0
dtype: float64

In [195]:
In [172]: data.loc[:, "one"] = 1

In [196]:
In [173]: data

          one  two  three  four
Ohio        1    0      0     0
Colorado    1    5      6     7
Utah        1    9     10    11
New York    1   13     14    15

In [197]:
In [174]: data.iloc[2] = 5

In [198]:
In [175]: data

          one  two  three  four
Ohio        1    0      0     0
Colorado    1    5      6     7
Utah        5    5      5     5
New York    1   13     14    15

In [199]:
In [176]: data.loc[data["four"] > 5] = 3

In [200]:
In [177]: data

          one  two  three  four
Ohio        1    0      0     0
Colorado    3    3      3     3
Utah        5    5      5     5
New York    3    3      3     3

In [201]:
In [179]: data

          one  two  three  four
Ohio        1    0      0     0
Colorado    3    3      3     3
Utah        5    5      5     5
New York    3    3      3     3

In [202]:
In [180]: data.loc[data.three == 5, "three"] = 6

In [203]:
In [181]: data

          one  two  three  four
Ohio        1    0      0     0
Colorado    3    3      3     3
Utah        5    5      6     5
New York    3    3      3     3

In [204]:
In [182]: s1 = pd.Series([7.3, -2.5, 3.4, 1.5], index=["a", "c", "d", "e"])

In [205]:
In [183]: s2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1],
   .....:                index=["a", "c", "e", "f", "g"])

In [206]:
In [184]: s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [207]:
In [185]: s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [208]:
In [186]: s1 + s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [209]:
In [187]: df1 = pd.DataFrame(np.arange(9.).reshape((3, 3)), columns=list("bcd"),
   .....:                    index=["Ohio", "Texas", "Colorado"])

In [210]:
In [188]: df2 = pd.DataFrame(np.arange(12.).reshape((4, 3)), columns=list("bde"),
   .....:                    index=["Utah", "Ohio", "Texas", "Oregon"])

In [211]:
In [189]: df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [212]:
In [190]: df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [213]:
In [191]: df1 + df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [214]:
In [192]: df1 = pd.DataFrame({"A": [1, 2]})

In [215]:
In [193]: df2 = pd.DataFrame({"B": [3, 4]})

In [216]:
In [194]: df1

   A
0  1
1  2

In [217]:
In [195]: df2

   B
0  3
1  4

In [218]:
In [196]: df1 + df2

    A   B
0 NaN NaN
1 NaN NaN

In [219]:
In [197]: df1 = pd.DataFrame(np.arange(12.).reshape((3, 4)),
   .....:                    columns=list("abcd"))

In [220]:
In [198]: df2 = pd.DataFrame(np.arange(20.).reshape((4, 5)),
   .....:                    columns=list("abcde"))

In [221]:
In [199]: df2.loc[1, "b"] = np.nan

In [222]:
In [200]: df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [223]:
In [201]: df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   NaN   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [224]:
In [202]: df1 + df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0   NaN  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [225]:
In [203]: df1.add(df2, fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0   5.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [226]:
In [204]: 1 / df1

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [227]:
In [205]: df1.rdiv(1)

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [228]:
In [206]: df1.reindex(columns=df2.columns, fill_value=0)

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

In [229]:
In [207]: arr = np.arange(12.).reshape((3, 4))

In [230]:
In [208]: arr

array([[ 0.,  1.,  2.,  3.],
       [ 4.,  5.,  6.,  7.],
       [ 8.,  9., 10., 11.]])

In [231]:
In [209]: arr[0]

array([0., 1., 2., 3.])

In [232]:
In [210]: arr - arr[0]

array([[0., 0., 0., 0.],
       [4., 4., 4., 4.],
       [8., 8., 8., 8.]])

In [233]:
In [211]: frame = pd.DataFrame(np.arange(12.).reshape((4, 3)),
   .....:                      columns=list("bde"),
   .....:                      index=["Utah", "Ohio", "Texas", "Oregon"])

In [234]:
In [212]: series = frame.iloc[0]

In [235]:
In [213]: frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [236]:
In [214]: series

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [237]:
In [215]: frame - series

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [238]:
In [216]: series2 = pd.Series(np.arange(3), index=["b", "e", "f"])

In [239]:
In [217]: series2

b    0
e    1
f    2
dtype: int64

In [240]:
In [218]: frame + series2

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

In [241]:
In [219]: series3 = frame["d"]

In [242]:
In [220]: frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [243]:
In [221]: series3

Utah       1.0
Ohio       4.0
Texas      7.0
Oregon    10.0
Name: d, dtype: float64

In [244]:
In [222]: frame.sub(series3, axis="index")

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

In [245]:
In [223]: frame = pd.DataFrame(np.random.standard_normal((4, 3)),
   .....:                      columns=list("bde"),
   .....:                      index=["Utah", "Ohio", "Texas", "Oregon"])

In [246]:
In [224]: frame

               b         d         e
Utah    0.735322 -0.070509 -0.712418
Ohio   -1.263488 -0.380097  1.352489
Texas   1.845803  0.412244  0.565183
Oregon  0.911078  1.703559 -0.249711

In [247]:
In [225]: np.abs(frame)

               b         d         e
Utah    0.735322  0.070509  0.712418
Ohio    1.263488  0.380097  1.352489
Texas   1.845803  0.412244  0.565183
Oregon  0.911078  1.703559  0.249711

In [248]:
In [226]: def f1(x):
   .....:     return x.max() - x.min()

In [249]:
In [227]: frame.apply(f1)

b    3.109291
d    2.083656
e    2.064907
dtype: float64

In [250]:
In [228]: frame.apply(f1, axis="columns")

Utah      1.447740
Ohio      2.615977
Texas     1.433559
Oregon    1.953270
dtype: float64

In [251]:
In [229]: def f2(x):
   .....:     return pd.Series([x.min(), x.max()], index=["min", "max"])

In [252]:
In [230]: frame.apply(f2)

            b         d         e
min -1.263488 -0.380097 -0.712418
max  1.845803  1.703559  1.352489

In [253]:
In [231]: def my_format(x):
   .....:     return f"{x:.2f}"

In [254]:
In [232]: frame.applymap(my_format)

/var/folders/nf/zm9hb0654b163bnmw_ts6bwh0000gp/T/ipykernel_86611/814779799.py:1: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  frame.applymap(my_format)

            b      d      e
Utah     0.74  -0.07  -0.71
Ohio    -1.26  -0.38   1.35
Texas    1.85   0.41   0.57
Oregon   0.91   1.70  -0.25

In [255]:
In [233]: frame["e"].map(my_format)

Utah      -0.71
Ohio       1.35
Texas      0.57
Oregon    -0.25
Name: e, dtype: object

In [256]:
In [234]: obj = pd.Series(np.arange(4), index=["d", "a", "b", "c"])

In [257]:
In [235]: obj

d    0
a    1
b    2
c    3
dtype: int64

In [258]:
In [236]: obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [259]:
In [237]: frame = pd.DataFrame(np.arange(8).reshape((2, 4)),
   .....:                      index=["three", "one"],
   .....:                      columns=["d", "a", "b", "c"])

In [260]:
In [238]: frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [261]:
In [239]: frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [262]:
In [240]: frame.sort_index(axis="columns")

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [263]:
In [241]: frame.sort_index(axis="columns", ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [264]:
In [242]: obj = pd.Series([4, 7, -3, 2])

In [265]:
In [243]: obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

In [266]:
In [244]: obj = pd.Series([4, np.nan, 7, np.nan, -3, 2])

In [267]:
In [245]: obj.sort_values()

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

In [268]:
In [246]: obj.sort_values(na_position="first")

1    NaN
3    NaN
4   -3.0
5    2.0
0    4.0
2    7.0
dtype: float64

In [269]:
In [247]: frame = pd.DataFrame({"b": [4, 7, -3, 2], "a": [0, 1, 0, 1]})

In [270]:
In [248]: frame

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [271]:
In [249]: frame.sort_values("b")

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [272]:
In [250]: frame.sort_values(["a", "b"])

   b  a
2 -3  0
0  4  0
3  2  1
1  7  1

In [273]:
In [251]: obj = pd.Series([7, -5, 7, 4, 2, 0, 4])

In [274]:
In [252]: obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [275]:
In [253]: obj.rank(method="first")

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [276]:
In [254]: obj.rank(ascending=False)

0    1.5
1    7.0
2    1.5
3    3.5
4    5.0
5    6.0
6    3.5
dtype: float64

In [277]:
In [255]: frame = pd.DataFrame({"b": [4.3, 7, -3, 2], "a": [0, 1, 0, 1],
   .....:                       "c": [-2, 5, 8, -2.5]})

In [278]:
In [256]: frame

     b  a    c
0  4.3  0 -2.0
1  7.0  1  5.0
2 -3.0  0  8.0
3  2.0  1 -2.5

In [279]:
In [257]: frame.rank(axis="columns")

     b    a    c
0  3.0  2.0  1.0
1  3.0  1.0  2.0
2  1.0  2.0  3.0
3  3.0  2.0  1.0

In [280]:
In [258]: obj = pd.Series(np.arange(5), index=["a", "a", "b", "b", "c"])

In [281]:
In [259]: obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [282]:
In [260]: obj.index.is_unique

False

In [283]:
In [261]: obj["a"]

a    0
a    1
dtype: int64

In [284]:
In [262]: obj["c"]

np.int64(4)

In [285]:
In [263]: df = pd.DataFrame(np.random.standard_normal((5, 3)),
   .....:                   index=["a", "a", "b", "b", "c"])

In [286]:
In [264]: df

          0         1         2
a  0.887762 -0.496232  0.887950
a -0.749278  0.022039  1.243146
b  0.216599  1.945742  0.073739
b  0.501716 -0.470031  0.181609
c  2.031239  1.010026  1.017795

In [287]:
In [265]: df.loc["b"]

          0         1         2
b  0.216599  1.945742  0.073739
b  0.501716 -0.470031  0.181609

In [288]:
In [266]: df.loc["c"]

0    2.031239
1    1.010026
2    1.017795
Name: c, dtype: float64

In [289]:
In [267]: df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5],
   .....:                    [np.nan, np.nan], [0.75, -1.3]],
   .....:                   index=["a", "b", "c", "d"],
   .....:                   columns=["one", "two"])

In [290]:
In [268]: df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [291]:
In [269]: df.sum()

one    9.25
two   -5.80
dtype: float64

In [292]:
In [270]: df.sum(axis="columns")

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [293]:
In [271]: df.sum(axis="index", skipna=False)

one   NaN
two   NaN
dtype: float64

In [294]:
In [272]: df.sum(axis="columns", skipna=False)

a     NaN
b    2.60
c     NaN
d   -0.55
dtype: float64

In [295]:
In [273]: df.mean(axis="columns")

a    1.400
b    1.300
c      NaN
d   -0.275
dtype: float64

In [296]:
In [274]: df.idxmax()

one    b
two    d
dtype: object

In [297]:
In [275]: df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [298]:
In [276]: df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [299]:
In [277]: obj = pd.Series(["a", "a", "b", "c"] * 4)

In [300]:
In [278]: obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

In [342]:
In [279]: price = pd.read_pickle("examples/yahoo_price.pkl")

In [280]: volume = pd.read_pickle("examples/yahoo_volume.pkl")

In [343]:
In [281]: returns = price.pct_change()

In [282]: returns.tail()

                AAPL      GOOG       IBM      MSFT
Date
2016-10-17 -0.000680  0.001837  0.002072 -0.003483
2016-10-18 -0.000681  0.019616 -0.026168  0.007690
2016-10-19 -0.002979  0.007846  0.003583 -0.002255
2016-10-20 -0.000512 -0.005652  0.001719 -0.004867
2016-10-21 -0.003930  0.003011 -0.012474  0.042096

In [344]:
In [283]: returns["MSFT"].corr(returns["IBM"])

np.float64(0.49976361144151155)

In [345]:
In [284]: returns["MSFT"].cov(returns["IBM"])

np.float64(8.870655479703549e-05)

In [346]:
In [285]: returns.corr()

          AAPL      GOOG       IBM      MSFT
AAPL  1.000000  0.407919  0.386817  0.389695
GOOG  0.407919  1.000000  0.405099  0.465919
IBM   0.386817  0.405099  1.000000  0.499764
MSFT  0.389695  0.465919  0.499764  1.000000

In [347]:
In [286]: returns.cov()

          AAPL      GOOG       IBM      MSFT
AAPL  0.000277  0.000107  0.000078  0.000095
GOOG  0.000107  0.000251  0.000078  0.000108
IBM   0.000078  0.000078  0.000146  0.000089
MSFT  0.000095  0.000108  0.000089  0.000215

In [348]:
In [287]: returns.corrwith(returns["IBM"])

AAPL    0.386817
GOOG    0.405099
IBM     1.000000
MSFT    0.499764
dtype: float64

In [349]:
In [288]: returns.corrwith(volume)

AAPL   -0.075565
GOOG   -0.007067
IBM    -0.204849
MSFT   -0.092950
dtype: float64

In [350]:
In [289]: obj = pd.Series(["c", "a", "d", "a", "a", "b", "b", "c", "c"])

In [351]:
In [290]: uniques = obj.unique()

In [352]:
In [291]: uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [353]:
In [292]: obj.value_counts()

c    3
a    3
b    2
d    1
Name: count, dtype: int64

In [354]:
In [293]: pd.value_counts(obj.to_numpy(), sort=False)

/var/folders/nf/zm9hb0654b163bnmw_ts6bwh0000gp/T/ipykernel_86611/1413364790.py:1: FutureWarning: pandas.value_counts is deprecated and will be removed in a future version. Use pd.Series(obj).value_counts() instead.
  pd.value_counts(obj.to_numpy(), sort=False)

c    3
a    3
d    1
b    2
Name: count, dtype: int64

In [355]:
In [294]: obj

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

In [356]:
In [295]: mask = obj.isin(["b", "c"])

In [357]:
In [296]: mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [358]:
In [297]: obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

In [359]:
In [298]: to_match = pd.Series(["c", "a", "b", "b", "c", "a"])

In [360]:
In [299]: unique_vals = pd.Series(["c", "b", "a"])

In [361]:
In [300]: indices = pd.Index(unique_vals).get_indexer(to_match)

In [362]:
In [301]: indices

array([0, 2, 1, 1, 0, 2])

In [363]:
In [302]: data = pd.DataFrame({"Qu1": [1, 3, 4, 3, 4],
   .....:                      "Qu2": [2, 3, 1, 2, 3],
   .....:                      "Qu3": [1, 5, 2, 4, 4]})

In [364]:
In [303]: data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [365]:
In [304]: data["Qu1"].value_counts().sort_index()

Qu1
1    1
3    2
4    2
Name: count, dtype: int64

In [366]:
In [305]: result = data.apply(pd.value_counts).fillna(0)

/var/folders/nf/zm9hb0654b163bnmw_ts6bwh0000gp/T/ipykernel_86611/2038204485.py:1: FutureWarning: pandas.value_counts is deprecated and will be removed in a future version. Use pd.Series(obj).value_counts() instead.
  result = data.apply(pd.value_counts).fillna(0)

In [367]:
In [306]: result

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

In [368]:
In [307]: data = pd.DataFrame({"a": [1, 1, 1, 2, 2], "b": [0, 0, 1, 0, 0]})

In [369]:
In [308]: data

   a  b
0  1  0
1  1  0
2  1  1
3  2  0
4  2  0

In [370]:
In [309]: data.value_counts()

a  b
1  0    2
2  0    2
1  1    1
Name: count, dtype: int64